/***  Задача по String Reverse  ***/
function strReverse(string) {
    return string.split('').reverse().join(''); /* split - превращает строку в массив, reverse - меняет порядок элементов в массиве на противоположный, join - слкеивает массив обратно в строку */
}
strReverse('Hello');
/**********************************/

/***  Задача по вычислению Факториала ***/

/*************** Запись через проверку*************************************/
    function factorial(arg) {
        if(arg != 1){
            return arg * factorial(arg-1);
        } else {
            return 1;
        };
    };    
    alert(factorial(+prompt('Факториал какого числа вы хотите увидеть?')));
	
/**************************** Тоже самое, только через тернарный операвор  ************/
    function factorial(arg) {
        return arg ? arg * factorial(arg - 1) : 1;
    };    
    alert(factorial(+prompt('Факториал какого числа вы хотите увидеть?')));   
    
/************************ Факториал черех Вайл  *****************************/
function factorial(arg){
     var res = 1;
     while(arg) {
         res *= arg--;
     }
     return res;
}
alert(factorial(+prompt('Факториал какого числа вы хотите увидеть?')));
/****************************************************************************/   

    